system/averaging
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "../system";
    object      averaging;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldAverage1
{
    type            fieldAverage;
    libs            ( "libfieldFunctionObjects.so" );
    writeControl    writeTime;
    timeStart       0;
    enabled         0;
    controlMode     time;
    fields          ( U { mean on ; prime2Mean off ; base iteration ; windowType approximate ; allowRestart false ; } p { mean on ; prime2Mean off ; base iteration ; windowType approximate ; allowRestart false ; } );
}


// ************************************************************************* //
